# Sanket Mhaske

In [79]:
import pandas as pd
import numpy as np

In [80]:
data= pd.read_csv('homeprices.csv')
data

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [81]:
x=data.drop(['bedrooms', 'age','price'],axis='columns')

In [82]:
y=data.price
y

0    550000
1    565000
2    610000
3    595000
4    760000
5    810000
Name: price, dtype: int64

# Simple Linear Regression

In [83]:
from sklearn import linear_model
model = linear_model.LinearRegression()

In [84]:
model.fit(x,y)

LinearRegression()

In [85]:
model.score(x,y)

0.8126597526459411

In [86]:
model.predict([[3300]])

array([628813.88621022])

# Multiple Linear Regression

In [87]:
data

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [88]:
mean = data.bedrooms.mean()
mean

4.2

In [89]:
median=data.bedrooms.median()
median

4.0

In [90]:
data.bedrooms=data.bedrooms.fillna(median)
data

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [91]:
a=data.drop('price',axis='columns')
a

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.0   18
3  3600       3.0   30
4  4000       5.0    8
5  4100       6.0    8

In [92]:
b=data.price
b

0    550000
1    565000
2    610000
3    595000
4    760000
5    810000
Name: price, dtype: int64

In [99]:
# from sklearn import linear_model
# reg = linear_model.LinearRegression

In [101]:
model.fit(a,b)

LinearRegression()

In [102]:
model.score(a,b)

0.9550196399325819

In [103]:
model.predict([[30000,10,14]])

array([3771841.01018797])